routes/web.php

select * from "products" order by RANDOM() limit 6
---
    ]);
});

Route::middleware('auth')->get('/dashboard/product', function () {
    $products = App\Models\Product::paginate(5);
    $categories = \App\Models\Category::all();
    return view('dashboard-product', [
        'title' => 'Dashboard Produk',
        'products' => $products,
        'categories' => $categories
    ]);
});