app/Http/Controllers/DashboardController.php

select * from "order_details" where "order_details"."order_id" in (2, 8, 10)
select * from "orders" where "user_id" = 2 order by "created_at" desc limit 5
select * from "products" where "products"."id" in (1, 3, 8, 9, 11, 16, 18, 20, 25, 33, 35, 37, 44, 45, 46, 49)
select SUM(total_price) as total, strftime("%Y-%m", created_at) as month from "orders" where "user_id" = 2 group by "month" order by "month" asc
---
    public function index()
    {
        // Get ID login auth
        $userId = Auth::id();

        // Mengambil data transaksi berdasarkan seller_id yang login
        $transactions = Order::whereHas('orderDetails', function ($query) use ($userId) {
            $query->where('seller_id', $userId);
        })
            ->with('orderDetails.product')
            ->latest()
            ->limit(5)
            ->get();

        // Mengambil data dari bulan ini
        $currentMonthTransactions = Order::whereHas('orderDetails', function ($query) use ($userId) {
            $query->where('seller_id', $userId);
        })
            ->where('payment_status', 'completed')
            ->whereMonth('created_at', now()->month)
            ->whereYear('created_at', now()->year)
            ->with('orderDetails.product')
            ->get();