app/Models/product.php

select * from "ratings" where "ratings"."product_id" = 9 and "ratings"."product_id" is not null
---
    public function averageRating()
    {
        return $this->ratings()->avg('rating') ?? 0;